{
  "_class_name": "VQModel",
  "_diffusers_version": "0.1.2",
  "act_fn": "silu",
  "block_out_channels": [
    128,
    256,
    512
  ],
  "down_block_types": [
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D"
  ],
  "in_channels": 3,
  "latent_channels": 3,
  "layers_per_block": 2,
  "num_vq_embeddings": 8192,
  "out_channels": 3,
  "sample_size": 256,
  "up_block_types": [
    "UpDecoderBlock2D",
    "UpDecoderBlock2D",
    "UpDecoderBlock2D"
  ]
}
